{"_id":"note:dt-5IuImw","title":"WEEK2","content":"## Physical Layer\n\n#### Source Encoding\nA source encoder transforms an analog signal into a digital\nsequence. The process consists of sampling, quantizing, and\nencoding. \n\n#### Channel Encoding\nThe main purpose of a channel encoder is to produce a\nsequence of data that is robust to noise and to provide error\ndetection and forward error correction mechanisms. In simple\nand cheap transceivers, forward error correction is costly and,\ntherefore, the task of channel encoding is limited to the detection\nof errors in packet transmission. \n\n#### Modulation\nModulation is a process by which the\ncharacteristics (amplitude, frequency, and phase) of\na carrier signal are modified according to the\nmessage (a baseband) signal. Modulation has\nseveral advantages:\n- the message signal will become resilient to noise.\n- the channel’s spectrum can be used efficiently.\n- signal detection will be simple. \n\n![](image-koxpcq1b.png)\n\n### Signal Propagation\nWireless sensor networks operate in the license-free ISM spectrum and therefore, they\nmust share the spectrum with and accept interference from devices that operate in the same spectrum - such as cordless phones, WLAN, Bluetooth, Microwave ovens, etc. \n\nA simple channel model ignores the effect of interference and considers the surrounding noise as the predominant factor that affects the transmitted signal. Furthermore, the noise can be modeled as an Additive White Gaussian Noise (AWGN) that has a constant spectral density over the entire operating spectrum and a normal amplitude distribution. In this model, the noise distorts the amplitude of the transmitted signal.\n\nThere are two approaches to deal with noise. First, one can increase the received power so that the signal-to-noise ratio is significantly high and the channel becomes agnostic to noise. \n\n### Industry Scientific and Medical (ISM)\n\n![](image-koxpt87z.png)\n\n### Physical Layer\nEnergy consumption minimization is of paramount importance when\ndesigning the physical layer for WSN in addition to the usual effects such\nas scattering, shadowing, reflection, diffraction, multipath, and fading.\n\n![](image-koxq3m3n.png)\n\nAssuming a linear relationship for the energy spent per bit by the transmitter and\nreceiver circuitry.\n\n![](image-koxq5azr.png)\n\n### Energy Limitationss\n- Each sensor nodoe has limited energy supply\n- Nodes may not be rechargeablke\n- Energy consumption in\n    - Sensing\n    - Data processing\n    - Communication (most energy intensive)\n\n### Power Saving Mechanisms\nThe amount of time and power needed to wakeup (start-up) a radio is not negligible and thus just turning off the radio whenever is not being\nused is not necessarily efficient.\n\nThe energy characteristics of the start-up time should also be taken into account when designing the size of the data link packets. The values shown in the figure below clearly indicate that when the start-up energy consumption is taken into account the energy per bit requirements can be significantly higher for the transmission of short packets than for longer ones.\n\n![](image-koxqwdy6.png)\n\n## Data Link Layer\n\nThe wireless medium must be shared by multiple network devices, therefore a mechanism is required to control access to the medium. This responsibility is carried out by the second layer of the OSI reference model (Figure 6.1), called the data link layer.\n\nAccording to the IEEE 802 reference model. This layer is further divided into\n- The logical link control layer.\n- The medium access control layer. \n\n![](image-koxqv5t1.png)\n\n### Medium Access Control (MAC)\n\n- The MAC layer operates directly on top of the physical layer, thereby assuming full control over the medium.\n- The main function of the MAC layer is to decide when a node accesses a shared medium and to resolve any potential conflicts between competing nodes. \n- It is also responsible for correcting communication errors occurring at the physical layer and performing other activities such as framing, addressing, and flow control.\n- Existing MAC protocols can be categorized by the way they control access to the medium. \n- Most MAC protocols fall either into the categories of contention-free or contention-based protocols. \n- In the first category, MAC protocols provide a medium sharing approach that ensures that only one device accesses the wireless medium at any given time. This category can further be divided into fixed and dynamic assignment classes, indicating whether the slot reservations are fixed or on-demand.\n- In contrast to contention-free techniques, contention-based protocols allow nodes to access the medium simultaneously, but provide mechanisms to reduce the number of collisions and to recover from such collisions.\n- Finally, some MAC protocols do not easily fit into this classification since they share characteristics of both contention-free and contention-based techniques. These hybrid approaches often aim to inherit the advantages of these main categories, while minimizing their weaknesses. \n\n### Light Medium Access Control (LMAC)\n- The Lightweight Medium Access Control (LMAC) protocol (Van Hoesel and Havinga 2004) is based on TDMA, that is, time is again divided into frames and slots, where each slot is owned by exactly one node. \n- However, instead of relying on a central manager to assign slots to nodes, nodes execute a distributed algorithm to allocate slots. \n- Each node uses its slot to transmit a message consisting of two parts:\n    - a control message\n    - a data unit\n- The fixed-size control message carries information such as the identity of the time slot controller, the distance (in hops) of the node to the gateway (base station), the address of the intended receiver, and the length of the data unit.\n- Upon receiving a control message, a node determines if it is the intended receiver and decides whether to stay awake or to turn off the radio until the next slot.\n- The Occupied Slots field of the control message is a bitmask of slots, where an unoccupied slot is represented by 0 and an occupied slot is represented by 1.\n- By combining control messages from all neighbors, a node is able to deter- mine unoccupied slots.\n- The process of claiming slots starts at the gateway device, which determines its own slots.\n- After one frame, all direct neighbors of the gateway know the gateway’s slots and choose their own slots. \n- This process continues throughout the network and during each frame, a new set of nodes with a higher hop distance from the gateway determine their slots.\n- Each node must select slots that are not in use within a two-hop neighborhood.\n- Slots are selected randomly, therefore, it is possible for multiple nodes to select the same slot.\n- This will result in a collision of control messages during a slot, which can be observed by the competing nodes, which, in turn, results in a restart of the selection process. \n\n### Sensor Medium Access Control (S-MAC)\n- The goal of the sensor MAC (S-MAC) protocol (Ye et al. 2002) is to reduce unnecessary energy consumption, while providing good scalability and collision avoidance. \n- S-MAC adopts a duty-cycle approach, that is, nodes periodically transition between a listen state and a sleep state. \n- Each node chooses its own schedule, though it is preferred when nodes synchronize their schedules such that they listen or sleep at the same time.\n- In this case, nodes using the same schedule are considered to belong to the same virtual cluster , but no real clustering takes place and all nodes are free to communicate with nodes outside their clusters. \n- Nodes periodically exchange their schedules with their neighbors using SYNC messages, that is, every node knows when any of its neighbors will be awake. \n- If node A wants to communicate with a neighbor B that uses a different schedule, A waits until B is listening and then initiates the data transfer. Contention for the medium is resolved using the RTS/CTS scheme. \n- In order to choose a schedule, a node initially listens to the medium for a certain amount of time. \n- If this node receives a schedule from a neighbor, it chooses this schedule as its own and this node becomes a follower. \n- The node broadcasts its new schedule after a random delay td (to minimize the possibility for collisions from multiple new followers). \n- Nodes can adopt multiple schedules, that is, if a node receives a different schedule after it has broadcast its own schedule, it adopts both schedules. \n- Further, if a node does not hear a schedule from another node, it determines its own schedule and broadcasts it to any potential neighbors. \n- This node becomes a synchronizer in that other nodes will begin to synchronize themselves with it. \n\n## Network Layer","tags":[],"folderPathname":"/School/ECE659","data":{},"createdAt":"2021-05-19T22:05:18.599Z","updatedAt":"2021-05-21T03:34:27.589Z","trashed":false,"_rev":"YU8T6xzgb"}